000100 IDENTIFICATION DIVISION.                                         00010025
000200                                                                  00020026
000300 PROGRAM-ID.                    PROGRAM3.                         00030027
000400 AUTHOR.                        HCL     .                         00040026
000500 DATE-WRITTEN.                  FEB 2019.                         00050027
000600                                                                  00060026
000700******************************************************************00070026
002300                                                                  00230001
002400 ENVIRONMENT DIVISION.                                            00240001
002500                                                                  00250001
002600***************************************************************** 00260001
002700**                                                                00270001
002800**   CONFIGURATION SECTION                                        00280001
002900**                                                                00290001
003000******************************************************************00300001
003100                                                                  00310001
003200 CONFIGURATION SECTION.                                           00320001
003300                                                                  00330001
003400 SPECIAL-NAMES.                                                   00340026
003500      DECIMAL-POINT IS COMMA.                                     00350026
003600                                                                  00360026
003700******************************************************************00370026
003800**                                                                00380026
003900**   INPUT-OUTPUT SECTION                                         00390026
004000**                                                                00400026
004100******************************************************************00410026
004200                                                                  00420026
004300 INPUT-OUTPUT SECTION.                                            00430026
004400                                                                  00440026
004500 FILE-CONTROL.                                                    00450026
004600******************************************************************00460026
004700**                                                                00470026
004800**   DATA DIVISION                                                00480026
004900**                                                                00490026
005000******************************************************************00500026
005100                                                                  00510026
005200 DATA DIVISION.                                                   00520026
005300                                                                  00530026
005400******************************************************************00540026
005500**                                                                00550026
005600**   FILE SECTION                                                 00560026
005700**                                                                00570026
005800******************************************************************00580026
005900                                                                  00590026
006000 FILE SECTION.                                                    00600026
006100                                                                  00610026
006200******************************************************************00620026
006300**                                                                00630026
006400**  WORKING-STORAGE SECTION                                       00640026
006500**                                                                00650026
006600******************************************************************00660026
006700                                                                  00670026
006800 WORKING-STORAGE SECTION.                                         00680026
006900                                                                  00690026
007000 01 WS-MIS-VARIABLES.                                             00700026       
007100    05  TOTAL-CHAR           PIC 9(05)   VALUE 0.                 00710026             
007200    05  XML-OUTPUT           PIC X(1000) VALUE QUOTES.            00720026   
007300 01 XML-INPUT.                                                    00730026
          02 INPUT-DATA  OCCURS 7 TIMES.                                00740026     
             05  NAME                 PIC X(10).                        00750026 
             05  AGE                  PIC X(02).                        00760026  

009040*----------------------------------------------------------------*00904026
009050 PROCEDURE DIVISION .                                             00905026
009060*----------------------------------------------------------------*00906026
009070 A-MAIN                                      SECTION.             00907026
009080*----------------------------------------------------------------*00908026
009090 A-001.                                                           00909026
009100                                                                  00910026
009200         MOVE "JOHN" TO NAME(1).                                  00920026
009300         MOVE "TOM" TO NAME(2).                                   00930026
009400         MOVE  "35"  TO AGE(1).                                   00940026
009500         MOVE  "24"  TO AGE(2).                                   00950026
               MOVE "DILIP" TO NAME(3).                                 
               MOVE "DEEPA" TO NAME(4).                                 00930026
009400         MOVE  "34"  TO AGE(3).                                   00940026
009500         MOVE  "24"  TO AGE(4).                                   00950026
009700
                                                                        
                                                                        
                                                                        
                                                                        
                                                                        
                                                                        
                                                                        
                                                                        
009700         XML GENERATE XML-OUTPUT                                  00960026 
               FROM XML-INPUT                                           00970026 
               COUNT IN TOTAL-CHAR                                      00980026
               ON EXCEPTION DISPLAY "ERROR-XML-CODE =  " XML-CODE.      00990026
               DISPLAY XML-OUTPUT(1:TOTAL-CHAR).                        01000026
	
012300 A-999.                                                           01010026
012400     GOBACK.                                                      01020026
012500                                                                  01030026
